-- MySQL dump 10.13  Distrib 8.0.22, for macos10.15 (x86_64)
--
-- Host: 192.168.1.4    Database: wd7sql
-- ------------------------------------------------------
-- Server version	8.0.23-0ubuntu0.20.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `catalog`
--

DROP TABLE IF EXISTS `catalog`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `catalog` (
  `id` int NOT NULL AUTO_INCREMENT,
  `title` varchar(512) DEFAULT NULL,
  `dt_in` datetime DEFAULT CURRENT_TIMESTAMP,
  `img` varchar(128) DEFAULT NULL,
  `brand` int DEFAULT NULL,
  `colors` int DEFAULT NULL,
  `category` int DEFAULT NULL,
  `price` int DEFAULT NULL,
  `available` int DEFAULT NULL,
  `img_id` int DEFAULT NULL,
  `img_url` varchar(512) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=81 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `catalog`
--

LOCK TABLES `catalog` WRITE;
/*!40000 ALTER TABLE `catalog` DISABLE KEYS */;
INSERT INTO `catalog` VALUES (1,'Уравновешенное кресло Sumatron','2019-11-10 18:53:31','',1,1,3,79,15,11,'38296_PE130209_S5.webp'),(2,'Няшное кресло Марципано Итальяно','2019-11-10 18:54:12','',2,4,3,55,1,12,'0325450_PE517970_S5.jpeg'),(3,'Аскорбиновое кресло','2019-11-10 18:54:29','',3,2,3,21,3,21,'0602091_PE680160_S5.webp'),(4,'Кресло Галатрон-Мегатрок','2019-11-10 18:54:53','',1,6,3,26,12,27,'0641725_PE700622_S5.webp'),(5,'Гравитационное кресло Астромарти','2019-11-10 18:55:37','',1,7,3,51,13,28,'0652829_PE707677_S5.webp'),(6,'Кресло Abandone','2019-11-10 18:55:46','',2,3,3,65,10,31,'0719584_PE732109_S5.webp'),(7,'Кресло Доминатор','2019-11-10 18:55:58','',3,6,3,57,8,32,'0719586_PE732111_S5.webp'),(8,'Кресло Унижатор','2019-11-10 18:56:05','',3,7,3,76,13,33,'0725425_PE734857_S5.webp'),(9,'Пуховое кресло Floctuation','2019-11-10 18:56:27','',4,1,3,93,1,41,'0767121_PE753991_S5.webp'),(10,'Кресло Четыре Чресла','2019-11-10 18:56:49','',1,1,3,25,5,42,'0769262_PE754933_S5.webp'),(11,'Румба-кумба, кресло Джумба','2019-11-10 18:57:08','',2,6,3,29,2,44,'9912403_images_1653927986.jpg'),(12,'Диван Дружба никому нинужна','2019-11-10 18:58:02','',2,3,4,57,17,13,'0425669_PE581483_S5.webp'),(13,'Диван Ubrella Club','2019-11-10 18:58:30','',2,4,4,84,1,16,'0506800_PE634676_S5.webp'),(14,'Дикий диван Сногсшибан','2019-11-10 18:58:49','',3,3,4,36,13,38,'0754049_PE747775_S5.webp'),(15,'Шелкопрядный диван Акдуранбан','2019-11-10 18:59:30','',2,4,4,110,5,30,'0713943_PE729858_S5.webp'),(16,'Гелиоцентричный диван Toma-Doma','2019-11-10 18:59:52','',1,8,4,30,4,38,'0754049_PE747775_S5.webp'),(17,'Диван без Изъян','2019-11-10 19:00:07','',2,5,4,106,6,39,'0759910_PE750538_S5.webp'),(18,'Диван Аскорбьан','2019-11-10 19:00:36','',1,8,4,23,19,40,'0761365_PE751231_S5.webp'),(20,'Лампа Радости','2019-11-10 19:01:39','',9,5,5,33,18,15,'0434787_PE588546_S5.webp'),(21,'Лампа Сладости','2019-11-10 19:01:46','',9,3,5,101,15,20,'0588932_PE673256_S5.webp'),(23,'Лампа Изогнутость','2019-11-10 19:02:15','',8,1,5,42,11,22,'0606879_PE682600_S5.webp'),(24,'Лампа Вогнутость','2019-11-10 19:02:21','',8,8,5,21,19,23,'0609296_PE684433_S5.webp'),(25,'Лампа Молодость','2019-11-10 19:02:33','',7,1,5,63,3,24,'0609306_PE684440_S5.webp'),(26,'Светильник Мостовой напильник','2019-11-10 19:03:09','',9,8,5,38,18,25,'0609308_PE684439_S5.webp'),(27,'Светильник Армагедон','2019-11-10 19:03:18','',9,1,5,87,3,26,'0613277_PE686201_S5.webp'),(28,'Светильник 25й Рубильник','2019-11-10 19:03:32','',8,6,5,107,19,29,'0687071_PE721952_S5.webp'),(29,'Светильник Напильник','2019-11-10 19:03:44','',7,1,5,58,9,45,'91505012_images_13656420529.jpg'),(30,'Стол письменный Ростаман','2019-11-10 19:04:29','',4,3,1,56,9,57,'Nathan_skrivebord.jpg'),(31,'Стол письменный Гуливан','2019-11-10 19:04:29','',5,3,1,89,18,9,'90b82e40ab440d.jpeg'),(32,'Стол письменный Надиван','2019-11-10 19:04:29','',6,6,1,63,3,35,'0735967_PE740301_S5.webp'),(33,'Стол письменный Дулусан','2019-11-10 19:04:29','',4,5,1,33,3,36,'0737089_PE740879_S5.webp'),(34,'Стол кухонный Zadvigan','2019-11-10 19:04:29','',4,7,1,63,4,37,'0737165_PE740925_S5.jpeg'),(35,'Стол кухонный Arabian','2019-11-10 19:04:29','',5,3,1,100,11,48,'5792462179.webp'),(36,'Стол кухонный Zucco','2019-11-10 19:04:29','',6,8,1,98,3,53,'Ikea-stolyi.jpg'),(37,'Стул Грустный','2019-11-10 19:04:29','',6,7,2,74,4,10,'503-597-89-adde-stul-krasnyj.jpg'),(38,'Стул Розовая Свежесть','2019-11-10 19:04:29','',5,3,2,63,9,14,'0428465_PE583568_S5.webp'),(39,'Стул Нежность и Зрелость','2019-11-10 19:04:29','',5,3,2,78,17,17,'0512767_PE638683_S5.webp'),(40,'Стул Знания Сила','2019-11-10 19:04:29','',5,4,2,86,17,18,'0512775_PE638684_S5.webp'),(41,'Стул Радость','2019-11-10 19:04:29','',6,2,2,84,16,34,'0729831_PE737187_S5.webp'),(42,'Стул Защитник','2019-11-10 19:04:29','',4,6,2,45,10,46,'1321087560_w640_h640_barnyj-stul-ikea.jpg'),(43,'Стул Именинник','2019-11-10 19:04:29','',4,8,2,60,0,47,'1637071890_stul-ikea-rnninge.jpg'),(44,'Стул Гуливер','2019-11-10 19:04:29','',5,4,2,51,12,17,'0512767_PE638683_S5.webp'),(45,'Стул Столет в обед','2019-11-10 19:04:29','',6,6,2,60,19,34,'0729831_PE737187_S5.webp'),(78,'Кресло Sumatron VOR','2021-05-10 14:20:57','',1,1,1,1212,12,NULL,'5f436f14f89679b383d6e0309395291d.png');
/*!40000 ALTER TABLE `catalog` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-05-10 15:29:39
